<template>
  <div class="about overflow-x-hidden">
    <TheHeader />

    <div class="absolute left-[35%] top-32 hidden xl:block">
      <svg width="100" height="100" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M95.4657 70.5205C84.3141 95.449 55.0654 106.617 30.1369 95.4658C5.2084 84.3143 -5.96001 55.0656 5.19157 30.1371C16.3432 5.20855 45.5919 -5.95986 70.5204 5.19173C95.4489 16.3433 106.617 45.592 95.4657 70.5205ZM26.5039 39.671C20.6178 52.829 26.5128 68.2673 39.6708 74.1535C52.8288 80.0396 68.2672 74.1446 74.1533 60.9866C80.0395 47.8286 74.1445 32.3902 60.9864 26.5041C47.8284 20.6179 32.3901 26.513 26.5039 39.671Z" fill="#0A3BC9" fill-opacity="0.7"/>
      </svg>
    </div>

    <div class="relative overflow-hidden w-full h-screen block xl:hidden">
      <img class="absolute object-cover -z-20 w-full h-screen object-center" src="../assets/Mask Group.png" alt="logo"/>
      <TheResponsiveHeader />
      <p dir="ltr" class="text-white font-light text-5xl ml-8 pb-8 absolute bottom-0 z-40 block xl:hidden">Every new <br> idea is <br> just a <br> mashup</p>
    </div>

    <TheSocialBlack />

    <div class="flex xl:pt-52 pt-4" dir="rtl">
      <div>
        <p class="text-[#FF6300] font-YekanM xl:text-xl text-lg xl:pr-44 pr-8 pt-5">سلام! ما نارنجی هستیم.</p>
      </div>

      <div>
        <svg width="49" height="46" viewBox="0 0 49 46" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M16.4916 0.57563C11.2785 -0.451202 6.18742 4.21277 6.20048 9.48028C8.04631 4.99771 11.7998 1.66954 16.4916 0.57563Z" fill="#FF8030"/>
          <path d="M41.7151 13.4574C46.2039 16.3003 46.6875 23.1878 43.0527 27.0003C44.7986 22.4779 44.3661 17.4801 41.7151 13.4574Z" fill="#FF8030"/>
          <path d="M16.8906 4.36328C12.8394 3.61438 8.95573 7.89987 9.61581 11.9064C11.397 8.4463 12.7776 6.20494 16.8906 4.36328Z" fill="#FF8030"/>
          <path d="M38.8188 15.9307C42.2734 18.1756 42.1415 23.9575 38.9051 26.4099C39.9943 22.6738 40.5353 20.0975 38.8188 15.9307Z" fill="#FF8030"/>
          <path d="M27.3882 35.015L33.1594 24.2064C33.4377 23.6852 33.4975 23.0748 33.3258 22.5095C33.154 21.9441 32.7647 21.4702 32.2435 21.1919V21.1919C31.7223 20.9136 31.1119 20.8537 30.5466 21.0255C29.9812 21.1973 29.5073 21.5866 29.229 22.1078L25.5564 28.986" stroke="#FF8030" stroke-width="1.875" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M25.5566 28.9859L31.3279 18.1774C31.6062 17.6561 31.666 17.0457 31.4942 16.4804C31.3225 15.9151 30.9332 15.4411 30.412 15.1628C29.8908 14.8845 29.2804 14.8247 28.715 14.9965C28.1497 15.1682 27.6758 15.5575 27.3975 16.0787L22.1509 25.9047" stroke="#FF8030" stroke-width="1.875" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M18.1879 23.8676L22.9426 14.9628C23.2209 14.4415 23.2808 13.8311 23.109 13.2658C22.9372 12.7005 22.5479 12.2265 22.0267 11.9482V11.9482C21.5055 11.6699 20.8951 11.6101 20.3298 11.7819C19.7644 11.9536 19.2905 12.3429 19.0122 12.8641L11.667 26.6205" stroke="#FF8030" stroke-width="1.875" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M22.1506 25.9048L28.4465 14.1136C28.7248 13.5924 28.7847 12.982 28.6129 12.4167C28.4411 11.8514 28.0518 11.3774 27.5306 11.0991C27.0094 10.8208 26.399 10.761 25.8337 10.9327C25.2684 11.1045 24.7944 11.4938 24.5161 12.015L18.2202 23.8062" stroke="#FF8030" stroke-width="1.875" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M27.3882 35.015C23.5386 42.2248 17.6866 43.725 12.2823 40.8394C6.87802 37.9538 5.98351 34.3509 6.32454 30.7132L7.81186 20.1427C7.99473 18.8158 8.72912 17.8868 9.97051 17.8543C11.2129 17.8216 12.3162 18.769 12.3087 20.0246L11.6666 26.6205" stroke="#FF8030" stroke-width="1.875" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
      </div>
    </div>

    <div class="absolute top-72 right-0 -z-50 hidden xl:block">
      <svg width="237" height="238" viewBox="0 0 237 238" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M237.128 0.156766C206.009 0.156774 175.194 6.28621 146.443 18.1951C117.693 30.104 91.569 47.5592 69.5642 69.564C47.5594 91.5688 30.1042 117.692 18.1953 146.443C6.28638 175.194 0.156962 206.008 0.156959 237.128L116.074 237.128C116.074 221.231 119.205 205.489 125.288 190.802C131.372 176.115 140.289 162.77 151.53 151.529C162.771 140.289 176.116 131.372 190.803 125.288C205.49 119.205 221.231 116.073 237.128 116.073L237.128 0.156766Z" fill="#F2F2F2" fill-opacity="0.49"/>
      </svg>
    </div>

    <div class="flex xl:flex-row-reverse flex-col justify-between xl:pr-44 -z-10 xl:pl-96 px-8 xl:mt-6 mt-3 relative">
      <div>
        <p dir="rtl" class="font-YekanB xl:text-5xl text-2xl text-[#4D4D4D] xl:text-black xl:leading-tight leading-snug">ما یک تیم دیجیتالی و <br class="hidden xl:block"> آژانس نرم افزاری در ایران هستیم. <br> استراتژی طراحی و توسعه در <br class="hidden xl:block"> تمام سیستم عامل ها.</p>
        
        <div class="absolute bottom-0 hidden xl:flex flex-col">
          <svg width="119" height="119" viewBox="0 0 119 119" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M100.32 77.666C90.1927 100.305 63.6303 110.448 40.9913 100.32C18.3523 90.1929 8.20967 63.6305 18.3371 40.9915C28.4644 18.3525 55.0268 8.20987 77.6658 18.3373C100.305 28.4646 110.448 55.027 100.32 77.666ZM21.6929 42.4928C12.3947 63.2784 21.707 87.6661 42.4926 96.9644C63.2782 106.263 87.666 96.9504 96.9642 76.1648C106.263 55.3792 96.9502 30.9914 76.1646 21.6931C55.379 12.3949 30.9912 21.7072 21.6929 42.4928Z" fill="#15BE62"/>
            <path d="M65.091 41C64.8014 41 64.5068 41.0766 64.2369 41.2537L46.8356 52.3426H38.7854C38.3534 52.3426 38 52.6872 38 53.1083V66.8917C38 67.3128 38.3534 67.6574 38.7854 67.6574H46.8356L64.2369 78.7463C64.5068 78.9186 64.8063 79 65.091 79C65.9107 79 66.6667 78.3635 66.6667 77.4637V42.5363C66.6667 41.6365 65.9107 41 65.091 41ZM63.1324 73.927L48.7696 64.7715L47.8861 64.2116H41.5342V55.7884H47.8861L48.7647 55.2285L63.1324 46.073V73.927ZM80.2146 58.2771H73.9315C73.4995 58.2771 73.1461 58.6217 73.1461 59.0428V60.9572C73.1461 61.3783 73.4995 61.7229 73.9315 61.7229H80.2146C80.6466 61.7229 81 61.3783 81 60.9572V59.0428C81 58.6217 80.6466 58.2771 80.2146 58.2771ZM78.1579 70.8065L72.7436 67.7579C72.6547 67.7083 72.5565 67.6762 72.4549 67.6635C72.3532 67.6508 72.2499 67.6578 72.151 67.684C72.0521 67.7102 71.9595 67.7552 71.8784 67.8163C71.7973 67.8775 71.7293 67.9536 71.6784 68.0403L70.7016 69.6914C70.4856 70.0552 70.6132 70.5242 70.9863 70.7348L76.4006 73.7834C76.4895 73.833 76.5876 73.8651 76.6893 73.8778C76.791 73.8905 76.8942 73.8835 76.9931 73.8573C77.0921 73.8311 77.1847 73.7861 77.2658 73.725C77.3469 73.6639 77.4148 73.5877 77.4658 73.501L78.4426 71.8499C78.6586 71.4861 78.526 71.0171 78.1579 70.8065ZM71.6735 51.9597C71.7244 52.0464 71.7924 52.1225 71.8735 52.1837C71.9546 52.2448 72.0472 52.2898 72.1461 52.316C72.245 52.3422 72.3483 52.3492 72.45 52.3365C72.5516 52.3238 72.6497 52.2917 72.7387 52.2421L78.153 49.1935C78.526 48.9829 78.6537 48.5139 78.4377 48.1501L77.4658 46.5038C77.4148 46.417 77.3469 46.3409 77.2658 46.2798C77.1847 46.2187 77.0921 46.1737 76.9931 46.1475C76.8942 46.1213 76.791 46.1143 76.6893 46.127C76.5876 46.1397 76.4895 46.1718 76.4006 46.2214L70.9863 49.27C70.807 49.3719 70.6764 49.5389 70.6231 49.7344C70.5697 49.9299 70.598 50.1381 70.7016 50.3134L71.6735 51.9597Z" fill="#15BE62"/>
          </svg>

          <div>
            <p class="font-YekanM text-[16px] text-[#BBBBBB] text-center" dir="rtl">ما کنار شما هستیم <br> صدامون کنید!</p>
          </div>
        </div>
      </div>

      <div>
        <p dir="rtl" class="font-YekanM text-right xl:text-xl mt-5 xl:my-0 text-[#4D4D4D] xl:leading-loose leading-7">
          ما به ارائه تجربیات نوآورانه و دیجیتال که تاثیر می گذارد افتخار می کنیم. <br  class="hidden xl:block"> از سال 2005 ، ما با افتخار با شرکت های نوپا و هر کس دیگری که در ارتباط <br class="hidden xl:block"> هستیم ، برای باز کردن ارزش از طریق خلاقیت ، فناوری و تفکرات شغلی <br class="hidden xl:block"> همکاری می کنیم. <br><br> آنچه ما اعتقاد داریم: <br> ما معتقدیم ایجاد تجربیات به یاد ماندنی بهترین راه برای ارتباط با مصرف <br class="hidden xl:block"> کنندگان است. از طراحی وب پویا گرفته تا استراتژی های بازاریابی پیشرفته ، <br class="hidden xl:block"> مامعتقدیم راه حل های سفارشی که امروز ایجاد می کنیم از روند های فردا <br class="hidden xl:block"> فراتر می روند. مهم نیست که محصول یا خدمات شما باشد ، داستانی برای <br class="hidden xl:block"> گفتن دارید. و ، ما بهترین آزانس برای گفتن ان هستیم.
        </p>
      </div>
    </div>

    <div class="px-44 hidden xl:block">
      <div class="relative overflow-hidden w-full h-[600px] mt-32">
        <img class="absolute object-cover w-full h-[600px] object-center" src="../assets/Mask Group.png" alt="logo"/>
      </div>
    </div>

    <div class="pl-64 pt-10 hidden xl:block">
      <svg width="67" height="67" viewBox="0 0 67 67" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M56.75 56.75C43.9094 69.5906 23.0906 69.5906 10.25 56.75C-2.59062 43.9094 -2.59062 23.0906 10.25 10.25C23.0906 -2.59062 43.9094 -2.59062 56.75 10.25C69.5906 23.0906 69.5906 43.9094 56.75 56.75ZM24.0402 24.0402C18.8156 29.2647 18.8156 37.7353 24.0402 42.9598C29.2647 48.1844 37.7353 48.1844 42.9598 42.9598C48.1844 37.7353 48.1844 29.2647 42.9598 24.0402C37.7353 18.8156 29.2647 18.8156 24.0402 24.0402Z" fill="#F2F2F2"/>
      </svg>
    </div>

    <AboutService />

    <div class="absolute left-[35%] pt-2 hidden xl:block">
      <svg width="114" height="114" viewBox="0 0 114 114" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M97 97.0001C74.9086 119.091 39.0914 119.091 17 97.0001C-5.09142 74.9087 -5.09142 39.0914 17 17C39.0914 -5.09138 74.9086 -5.09138 97 17C119.091 39.0914 119.091 74.9087 97 97.0001ZM34.3408 34.3409C21.8265 46.8552 21.8265 67.1449 34.3408 79.6592C46.8551 92.1735 67.1449 92.1735 79.6592 79.6592C92.1735 67.1449 92.1735 46.8552 79.6592 34.3409C67.1449 21.8265 46.8551 21.8265 34.3408 34.3409Z" fill="#F2F2F2"/>
      </svg>
    </div>

    <AboutPartners />

    <div class="border-b-2 text-[#ACACAC] xl:mx-44 mx-8 xl:my-24 my-12"></div>
    
    <AboutHonors />

    <TheFooter />
  </div>
</template>

<script>
  import TheFooter from "@/components/Footers/TheFooter.vue";
  import TheHeader from "@/components/Headers/TheHeader.vue";
  import TheSocialBlack from "@/components/Social/TheSocialBlack.vue";
  import TheResponsiveHeader from "@/components/Headers/TheResponsiveHeader.vue";
  import AboutService from "@/components/Services/AboutService.vue";
  import AboutPartners from "@/components/AboutPartners.vue";
  import AboutHonors from "@/components/AboutHonors.vue";

  export default {
    components: {
      TheFooter,
      TheHeader,
      TheSocialBlack,
      TheResponsiveHeader,
      AboutService,
      AboutPartners,
      AboutHonors
    },
    data() {
      return {}
    }
  }
</script>