<template>
    <div>
        <div dir="rtl" class="flex xl:px-44 px-8 xl:mt-36 mt-5 items-center">
            <div class="flex-1 relative hidden xl:block">
                <div class="absolute left-28">
                    <svg width="132" height="132" viewBox="0 0 132 132" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M0 66C0 102.451 29.5492 132 66 132C102.451 132 132 102.451 132 66C132 29.5492 102.451 0 66 0C29.5492 0 0 29.5492 0 66ZM106.481 66C106.481 88.357 88.357 106.481 66 106.481C43.643 106.481 25.5191 88.357 25.5191 66C25.5191 43.643 43.643 25.5191 66 25.5191C88.357 25.5191 106.481 43.643 106.481 66Z" fill="#767676"/>
                    </svg>
                </div>

                <div class="absolute -right-[75px] z-40 mt-44">
                    <svg width="153" height="153" viewBox="0 0 153 153" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 153 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 136.987 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 120.975 108.393)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 104.962 124.405)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 140.418)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 144.994 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 128.981 100.386)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 112.969 116.399)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 132.412)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 148.424)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 144.994 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 128.981 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 112.969 100.386)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 116.399)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 132.412)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 136.987 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 120.975 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 104.962 108.393)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 124.405)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 140.418)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 136.987 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 120.975 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 104.962 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 108.393)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 124.405)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 128.981 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 112.969 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 100.386)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 116.399)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 132.412)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 128.981 52.3489)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 112.969 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 100.386)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 116.399)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 120.975 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 104.962 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 108.393)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 56.9247 124.405)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 120.975 44.3425)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 104.962 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 56.9247 108.393)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 112.969 52.3489)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 100.386)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 48.9185 116.399)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 112.969 36.3363)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 52.3489)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 48.9185 100.386)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 104.962 44.3425)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 56.9247 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 40.9122 108.393)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 104.962 28.3301)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 44.3425)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 56.9247 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 40.9122 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 36.3363)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 52.3489)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 48.9185 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 32.9059 100.386)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 96.9561 20.3237)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 36.3363)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 52.3489)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 48.9185 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 32.9059 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 28.3301)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 44.3425)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 56.9247 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 40.9122 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 24.8996 92.3802)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 88.9498 12.3175)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 28.3301)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 56.9247 44.3425)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 40.9122 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 24.8997 76.3677)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 20.3237)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 36.3363)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 48.9185 52.3489)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 32.9059 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 16.8934 84.3739)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 80.9435 4.31116)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 64.931 20.3237)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 48.9185 36.3363)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 32.9059 52.3489)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 16.8934 68.3615)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 72.9373 12.3175)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 56.9247 28.3301)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 40.9122 44.3425)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 24.8996 60.3551)" fill="#CFCFCF"/>
                        <circle cx="3.04839" cy="3.04839" r="3.04839" transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 8.88708 76.3677)" fill="#CFCFCF"/>
                    </svg>
                </div>

                <div class="absolute -right-[65px] z-40 -bottom-12">
                    <svg width="242" height="121" viewBox="0 0 242 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M0 0C0 15.89 3.12976 31.6243 9.21057 46.3047C15.2914 60.9851 24.2042 74.324 35.4401 85.5599C46.676 96.7958 60.0149 105.709 74.6953 111.789C89.3757 117.87 105.11 121 121 121C136.89 121 152.624 117.87 167.305 111.789C181.985 105.709 195.324 96.7958 206.56 85.5599C217.796 74.324 226.709 60.9851 232.789 46.3047C238.87 31.6243 242 15.8899 242 -7.62939e-06H176.392C176.392 7.27419 174.959 14.4771 172.176 21.1976C169.392 27.9181 165.312 34.0245 160.168 39.1681C155.024 44.3117 148.918 48.3919 142.198 51.1756C135.477 53.9593 128.274 55.392 121 55.392C113.726 55.392 106.523 53.9593 99.8024 51.1756C93.0819 48.3919 86.9755 44.3117 81.8319 39.1681C76.6883 34.0245 72.6081 27.9181 69.8244 21.1976C67.0407 14.4771 65.608 7.27419 65.608 0H0Z" fill="#FF8030"/>
                    </svg>
                </div>

                <img src="../../assets/Rectangle 102.png" alt="image" class="w-3/4 relative z-30 mt-16" />
            </div>
            
            <div class="flex-1">
                <p class="font-YekanM text-[#FF6300] xl:text-xl text-lg pt-8">طراحی موبایل اپلیکیشن</p>
                <p class="font-YekanB xl:text-4xl text-2xl xl:leading-snug leading-snug xl:mt-6 mt-3 text-[#4D4D4D] xl:text-black">برنامه های بصری و کاربردی بسازید <br class="hidden xl:block"> که توجه کاربران را به خود جلب کرده <br class="hidden xl:block"> و حفظ کنند</p>
                <p class="font-YekanM xl:text-xl text-[#4D4D4D] xl:leading-10 leading-8 xl:mt-8 mt-5">توسعه تلفن همراه یک فرآیند مداوم و تلاشی مداوم برای بهتر و بهتر شدن <br class="hidden xl:block"> محصول شما است. دستگاه ها و فناوری هایی که کاربران از طرسق انها در <br class="hidden xl:block"> تعامل با محصول شما هستند ، به عنوان کاربران ، نیاز ها و رفتار آنها تغییر <br class="hidden xl:block"> می کنند. برای مقابله با این چالش ها ، از ابزار های مناسب و روشهای <br class="hidden xl:block"> آزمایش شده از نبرد اطمینان حاصل کنید. و هرگز روند را متوقف نکنید.</p>
            </div>
        </div>
    </div>
</template>